# SetDLSeparation

## Description
Sets the Double Line Preferences separation.

```pascal
PROCEDURE SetDLSeparation(separationDistance : REAL (Coordinate));
```

```python

def vs.SetDLSeparation(separationDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|separationDistance|REAL (Coordinate)|The separation.|

## See Also
VS Functions:
GetDLSeparation

## Version
Availability: from VectorWorks12.5
## Category
* Document Settings